{
    "languages": {
      "HTML": {
        "description": "Hypertext Markup Language (HTML) is the standard markup language for creating web pages and web applications.",
        "usage": "Used to structure the content of a web page, define its layout, and add various media elements.",
        "example": "<!DOCTYPE html>\n<html>\n<head>\n<title>My Web Page</title>\n</head>\n<body>\n<h1>Hello, World!</h1>\n<p>This is my web page.</p>\n</body>\n</html>"
      },
      "CSS": {
        "description": "Cascading Style Sheets (CSS) is a stylesheet language used to control the presentation of web pages.",
        "usage": "Used to style the layout, fonts, colors, and other visual aspects of a web page.",
        "example": "h1 {\n  color: blue;\n  font-size: 24px;\n}"
      },
      "JavaScript": {
        "description": "JavaScript is a high-level, interpreted programming language primarily used for web development.",
        "usage": "Used to add interactivity, dynamic content, and behavior to web pages.",
        "example": "function greet(name) {\n  return 'Hello, ' + name + '!';\n}\n\nconsole.log(greet('John'));"
      }
    },
    "projectIdeas": [
      "Create a simple portfolio website using HTML and CSS.",
      "Build a to-do list application with HTML, CSS, and JavaScript.",
      "Develop a weather app that fetches data from an API and displays it on a web page.",
      "Design and implement a responsive landing page for a fictional product or service.",
      "Create a memory game using HTML, CSS, and JavaScript.",
      "Build a calculator with HTML, CSS, and JavaScript.",
      "Develop a quiz application with multiple-choice questions using HTML, CSS, and JavaScript."
    ],
    "interviewQuestions": {
      "HTML": [
        "What is the purpose of the <!DOCTYPE> declaration?",
        "Explain the difference between <div> and <span> elements.",
        "What are semantic elements in HTML and why are they important?",
        "How do you embed an image in an HTML page?",
        "What is the significance of the alt attribute in an image tag?"
      ],
      "CSS": [
        "What is the box model in CSS?",
        "Explain the difference between margin and padding.",
        "How can you center an element horizontally and vertically in CSS?",
        "What are media queries, and how are they used in responsive web design?",
        "How do you apply CSS styles to only certain elements with a specific class?"
      ],
      "JavaScript": [
        "What is the difference between var, let, and const for declaring variables?",
        "Explain the concept of closures in JavaScript.",
        "How do you handle errors in JavaScript using try...catch?",
        "What are callbacks and how do you use them?",
        "What is the purpose of the 'this' keyword in JavaScript?"
      ]
    }
  }
  